Revit 2024 API
AnalysisDisplayDiagramSettings Members
The AnalysisDisplayDiagramSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayDiagramSettings()
 Constructs a default instance of diagram settings.
AnalysisDisplayDiagramSettings(AnalysisDisplayDiagramSettings)
 Constructs a new copy of the input AnalysisDisplayDiagramSettings object.
Methods
Name | Description
Dispose
Releases all resources used by the AnalysisDisplayDiagramSettings
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Compares two diagram settings objects.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
FenceType
 Type of diagram fence visualization.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OutlineColor
 Color of outline and fence lines in the diagram.
OutlineLineWeight
 Line weight of outline and fence lines in the diagram.
Rounding
 Increment to which numeric values of analysis results are rounded in diagram.
TextLabelType
 Type of diagram text label visualization.
TextTypeId
 Element id of text associated with the settings.
Transparency
 Transparency percentage of diagram color fill
See Also
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace